* Specifications

Ent is a build tool like ant but working inside emacs and using elisp
instead of XML.

* Implementation

*** [2010-12-12 Sun] in ENT define a ent-config-file variable and a command ent-goto-config-file

* Tasks
** DONE [#B] create ent project
   SCHEDULED: <2010-12-13 Mon> CLOSED: [2010-12-13 Mon 18:25]
                                                                       :LOGBOOK:
   CLOCK: [2010-12-13 Mon 18:18]--[2010-12-13 Mon 18:25] =>  0:07
   CLOCK: [2010-12-13 Mon 11:01]--[2010-12-13 Mon 11:14] =>  0:13
   CLOCK: [2010-12-13 Mon 10:50]--[2010-12-13 Mon 10:52] =>  0:02
   CLOCK: [2010-12-13 Mon 10:23]--[2010-12-13 Mon 10:46] =>  0:23
                                                                           :END:
                                                                    :PROPERTIES:
   :Effort:   1:00
                                                                           :END:
   [2010-10-28 Thu]
** TODO [#B] convert ebld code to ent code                         :computer:
   SCHEDULED: <2010-12-16 Thu>
   :PROPERTIES:
   :Effort:   1:00
   :END:
** TODO [#B] add in ebuild useful features from mk
   



* COMMENT Setup
#+STARTUP: overview
#+STARTUP: logdone
#+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
